{
  "EU_DSA": {
    "id": "eu_dsa",
    "title": "EU Digital Services Act",
    "jurisdiction": "EU",
    "severity": "high",
    "summary": "Platforms must offer user-friendly illegal-content reporting, act on notices promptly, maintain notice/action logs, publish transparency reports, and explain how recommender systems and ads work—especially around risks to minors."
  },
  "EU_GDPR": {
    "id": "eu_gdpr",
    "title": "EU General Data Protection Regulation",
    "jurisdiction": "EU",
    "severity": "high",
    "summary": "Require a lawful basis, clear privacy notices, user rights (access/delete/rectify), and strong security. High-risk features like profiling need a Data Protection Impact Assessment."
  },
  "US_COPPA": {
    "id": "us_coppa",
    "title": "Children’s Online Privacy Protection Act",
    "jurisdiction": "US-Federal",
    "severity": "high",
    "summary": "Obtain verifiable parental consent before collecting, using, or disclosing personal data from children under 13; provide clear privacy notices; minimize data; and maintain reasonable security."
  },
  "US_NCMEC_REPORTING": {
    "id": "us_ncmec_reporting",
    "title": "NCMEC Reporting (CSAM)",
    "jurisdiction": "US-Federal",
    "severity": "critical",
    "summary": "Online services must report apparent CSAM they become aware of to NCMEC without delay and preserve relevant data for law enforcement."
  },
  "US_CA_AADC": {
    "id": "us_ca_aadc",
    "title": "California Age-Appropriate Design Code (guidance-focused)",
    "jurisdiction": "US-CA",
    "severity": "medium",
    "summary": "High-privacy defaults for minors, DPIAs for youth-facing features, limits on profiling/geolocation, and avoidance of dark patterns that nudge children to share more data."
  },
  "US_FL_MINOR_ONLINE_SAFETY": {
    "id": "us_fl_minor_online_safety",
    "title": "Florida Minor Online Safety Requirements",
    "jurisdiction": "US-FL",
    "severity": "medium",
    "summary": "Age verification, parental consent for younger users, and restrictions on addictive/harmful features for minors, including limiting night-time notifications."
  },
  "US_UT_SOCIAL_MEDIA": {
    "id": "us_ut_social_media",
    "title": "Utah Social Media Requirements for Minors",
    "jurisdiction": "US-UT",
    "severity": "medium",
    "summary": "Verify age; obtain parental consent for minors; provide parental controls and access; set night-time curfews/notification limits; and enable the most protective defaults for minors."
  }
}
